       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. Claude.

       PROCEDURE DIVISION.
           DISPLAY "Hello World MorningStar".

           STOP RUN.