000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. A.
000003 DATA DIVISION.
000004   WORKING-STORAGE SECTION.
000005 77 X     PIC  999.
000006 77 Y     PIC  999.
000007 77 MAXI  PIC 999.
000008 PROCEDURE DIVISION.
000009 MAIN.
           display "Entrer la valeur de X"
           accept X
           display "Entrer la valeur de y"
           accept Y
000010     CALL "MAXI" USING CONTENT X Y REFERENCE MAXI.
000011     DISPLAY "max (" X "," Y ") = " MAXI.
000012     STOP RUN.
000013 END PROGRAM A.
000014****************************
000015 IDENTIFICATION DIVISION.
000016   PROGRAM-ID. MAXI.
000017 DATA DIVISION.
000018   LINKAGE SECTION.
000019 77 A     PIC 999.
000020 77 B     PIC 999.
000021 77 MAXI  PIC 999.
000022 PROCEDURE DIVISION USING A B MAXI.
000023 PROG.
000024     IF A > B
000025        THEN
              MOVE A TO MAXI
000026     ELSE
              MOVE B TO MAXI
000027     END-IF.
000028     EXIT PROGRAM.
000029 END PROGRAM MAXI.